# SQL Murder Mystery

## Can you find out whodunnit?

![A decorative illustration of a detective looking at an evidence board.](https://mystery.knightlab.com/174092-clue-illustration.png)

There's been a Murder in SQL City! The SQL Murder Mystery is designed to be both a self-directed lesson to learn SQL concepts and commands and a fun game for experienced SQL users to solve an intriguing crime.

## SQL sleuths start here

A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a **​murder​** that occurred sometime on ​**Jan.15, 2018​** and that it took place in ​**SQL City​**. Start by retrieving the corresponding crime scene report from the police department’s database.

### Exploring the Database Structure

Experienced SQL users can often use database queries to infer the structure of a database. But each database system has different ways of managing this information. The SQL Murder Mystery is built using SQLite. Use this SQL command to find the tables in the Murder Mystery database.

Run this query to find the names of the tables in this database.

This command is specific to SQLite. For other databases, you'll have to learn their specific syntax.

In [4]:
# Install/upgrade necessary packages
%pip install --upgrade prettytable ipython-sql sqlalchemy pandas --quiet

# My python environment doesn't upgrade automatically?
%pip install prettytable==3.9.0 --force-reinstall --no-cache-dir

# Load SQL magic
%load_ext sql

# Connect to the database
%sql sqlite:///sql-murder-mystery.db

Note: you may need to restart the kernel to use updated packages.
Collecting prettytable==3.9.0
  Downloading prettytable-3.9.0-py3-none-any.whl.metadata (26 kB)
Collecting wcwidth (from prettytable==3.9.0)
  Downloading wcwidth-0.2.13-py2.py3-none-any.whl.metadata (14 kB)
Downloading prettytable-3.9.0-py3-none-any.whl (27 kB)
Downloading wcwidth-0.2.13-py2.py3-none-any.whl (34 kB)
Installing collected packages: wcwidth, prettytable
  Attempting uninstall: wcwidth
    Found existing installation: wcwidth 0.2.13
    Uninstalling wcwidth-0.2.13:
      Successfully uninstalled wcwidth-0.2.13
  Attempting uninstall: prettytable
    Found existing installation: prettytable 3.16.0
    Uninstalling prettytable-3.16.0:
      Successfully uninstalled prettytable-3.16.0
Successfully installed prettytable-3.9.0 wcwidth-0.2.13
Note: you may need to restart the kernel to use updated packages.
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [21]:
%%sql
SELECT name
FROM sqlite_master
where type = 'table';

 * sqlite:///sql-murder-mystery.db
Done.

[('crime_scene_report',),
 ('drivers_license',),
 ('facebook_event_checkin',),
 ('interview',),
 ('get_fit_now_member',),
 ('get_fit_now_check_in',),
 ('solution',),
 ('income',),
 ('person',)]


Besides knowing the table names, you need to know how each table is structured. The way this works is also dependent upon which database technology you use. Here's how you do it with SQLite.

Run this query to find the structure of the `crime_scene_report` table

Change the value of 'name' to see the structure of the other tables you learned about with the previous query.

In [20]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'crime_scene_report';

 * sqlite:///sql-murder-mystery.db
Done.

[('CREATE TABLE crime_scene_report (\n        date integer,\n        type text,\n        description text,\n        city text\n    )',)]


### The rest is up to you!

If you're really comfortable with SQL, you can probably get it from here. To help, here is the schema diagram:

![schema diagram](schema.png)

Use your knowledge of the database schema and SQL commands to find out who committed the murder.
### Check your solution

Did you find the killer? When you think you know the answer, submit your suspect using the following code and find out if you're right.

In [19]:
%%sql
SELECT *
FROM crime_scene_report
WHERE type = 'murder' and city = 'SQL City' and date = '20180115';

 * sqlite:///sql-murder-mystery.db
Done.

[(20180115, 'murder', 'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".', 'SQL City')]

In [29]:
%%sql
SELECT *
FROM person
WHERE 
    (address_street_name = 'Northwestern Dr' AND address_number = (
        SELECT MAX(address_number)
        FROM person
        WHERE address_street_name = 'Northwestern Dr'
    ))
    OR (address_street_name = 'Franklin Ave' AND name LIKE '%Annabel%');

 * sqlite:///sql-murder-mystery.db
Done.

[(14887, 'Morty Schapiro', 118009, 4919, 'Northwestern Dr', '111564949'),
 (16371, 'Annabel Miller', 490173, 103, 'Franklin Ave', '318771143')]

In [39]:
%%sql
SELECT *
FROM interview
INNER JOIN person ON person_id = id
WHERE 
    (address_street_name = 'Northwestern Dr' AND address_number = (
        SELECT MAX(address_number)
        FROM person
        WHERE address_street_name = 'Northwestern Dr'
    ))
    OR (address_street_name = 'Franklin Ave' AND name LIKE '%Annabel%');

 * sqlite:///sql-murder-mystery.db
Done.

[(14887, 'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".', 14887, 'Morty Schapiro', 118009, 4919, 'Northwestern Dr', '111564949'),
 (16371, 'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.', 16371, 'Annabel Miller', 490173, 103, 'Franklin Ave', '318771143')]

In [52]:
%%sql
SELECT *
FROM get_fit_now_member
INNER JOIN get_fit_now_check_in on id = membership_id
WHERE membership_status = 'gold' and check_in_date = '20180109' and membership_id LIKE '%48Z%'
LIMIT 5;

 * sqlite:///sql-murder-mystery.db
Done.

[('48Z7A', 28819, 'Joe Germuska', 20160305, 'gold', '48Z7A', 20180109, 1600, 1730),
 ('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold', '48Z55', 20180109, 1530, 1700)]

In [55]:
%%sql
SELECT *
FROM get_fit_now_member
INNER JOIN person on get_fit_now_member.person_id = person.id
INNER JOIN drivers_license on person.license_id = drivers_license.id
WHERE plate_number LIKE '%H42W%' and (get_fit_now_member.name LIKE '%Joe Germuska%' or get_fit_now_member.name LIKE '%Jeremy Bowers%')
LIMIT 5;

 * sqlite:///sql-murder-mystery.db
Done.

[('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold', 67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', '871539279', 423327, 30, 70, 'brown', 'brown', 'male', '0H42W2', 'Chevrolet', 'Spark LS')]

In [56]:
%%sql
INSERT INTO solution VALUES (1, 'Jeremy Bowers');
SELECT value FROM solution;

 * sqlite:///sql-murder-mystery.db
1 rows affected.
Done.

[("Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murd ... (88 characters truncated) ... r SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer.",)]

In [58]:
%%sql
SELECT *
FROM interview
INNER JOIN person ON person_id = id
WHERE name LIKE '%Jeremy Bowers%';

 * sqlite:///sql-murder-mystery.db
Done.

[(67318, 'I was hired by a woman with a lot of money. I don\'t know her name but I know she\'s around 5\'5" (65") or 5\'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n', 67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', '871539279')]

In [69]:
%%sql
SELECT *
FROM facebook_event_checkin
WHERE event_name LIKE '%Symphony%' 
  AND date LIKE '201712%'
  AND person_id IN (
      SELECT person_id
      FROM facebook_event_checkin
      GROUP BY person_id
      HAVING COUNT(person_id) >= 3
  );

 * sqlite:///sql-murder-mystery.db
Done.

[(19260, 1143, 'SQL Symphony Concert', 20171214),
 (58898, 1143, 'SQL Symphony Concert', 20171220),
 (19292, 1143, 'SQL Symphony Concert', 20171213),
 (43366, 1143, 'SQL Symphony Concert', 20171207),
 (92343, 1143, 'SQL Symphony Concert', 20171212),
 (28582, 1143, 'SQL Symphony Concert', 20171220),
 (28582, 1143, 'SQL Symphony Concert', 20171215),
 (24397, 1143, 'SQL Symphony Concert', 20171208),
 (79312, 1143, 'SQL Symphony Concert', 20171203),
 (24556, 1143, 'SQL Symphony Concert', 20171207),
 (24556, 1143, 'SQL Symphony Concert', 20171221),
 (24556, 1143, 'SQL Symphony Concert', 20171224),
 (99716, 1143, 'SQL Symphony Concert', 20171206),
 (99716, 1143, 'SQL Symphony Concert', 20171212),
 (99716, 1143, 'SQL Symphony Concert', 20171229)]

In [72]:
%%sql
WITH person_counts AS (
    SELECT person_id
    FROM facebook_event_checkin
    WHERE event_name LIKE '%Symphony%' 
      AND date LIKE '201712%'
    GROUP BY person_id
    HAVING COUNT(*) >= 3
)
SELECT *
FROM facebook_event_checkin
JOIN person_counts ON facebook_event_checkin.person_id = person_counts.person_id
WHERE facebook_event_checkin.event_name LIKE '%Symphony%' 
  AND facebook_event_checkin.date LIKE '201712%';

 * sqlite:///sql-murder-mystery.db
Done.

[(24556, 1143, 'SQL Symphony Concert', 20171207, 24556),
 (24556, 1143, 'SQL Symphony Concert', 20171221, 24556),
 (24556, 1143, 'SQL Symphony Concert', 20171224, 24556),
 (99716, 1143, 'SQL Symphony Concert', 20171206, 99716),
 (99716, 1143, 'SQL Symphony Concert', 20171212, 99716),
 (99716, 1143, 'SQL Symphony Concert', 20171229, 99716)]

In [80]:
%%sql
SELECT *
FROM person
INNER JOIN drivers_license on person.license_id = drivers_license.id
INNER JOIN income on person.ssn = income.ssn
WHERE gender = 'female' and hair_color = 'red' and car_make LIKE '%Tesla%' and car_model LIKE '%Model S%' and (person.id = '99716' or person.id = '24556')
LIMIT 5;

 * sqlite:///sql-murder-mystery.db
Done.

[(99716, 'Miranda Priestly', 202298, 1883, 'Golden Ave', '987756388', 202298, 68, 66, 'green', 'red', 'female', '500123', 'Tesla', 'Model S', '987756388', 310000)]

In [79]:
%%sql
INSERT INTO solution VALUES (1, 'Miranda Priestly');
SELECT value FROM solution;

 * sqlite:///sql-murder-mystery.db
1 rows affected.
Done.

[('Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne!',)]